## 🏗️ Terraform Plan Preview

## 📋 Terraform Plan Summary

### Resource Changes

- ✅ **Resources to Add:** 29
- 🔄 **Resources to Change:** 0
0
- ❌ **Resources to Destroy:** 0
0

<details>
<summary>📄 Full Plan Output (click to expand)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/protein-classifier-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "protein-classifier-ecs-logs"
        }
      + tags_all          = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-ecs-logs"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
    }

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/protein-classifier-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "protein-classifier-vpc-flow-logs"
        }
      + tags_all          = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-vpc-flow-logs"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
    }

  # aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "protein-classifier-terraform-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Name"        = "protein-classifier-terraform-locks"
        }
      + tags_all         = {
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-terraform-locks"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_ecr_lifecycle_policy.api will be created
  + resource "aws_ecr_lifecycle_policy" "api" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "main-",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "protein-classifier-api"
    }

  # aws_ecr_repository.api will be created
  + resource "aws_ecr_repository" "api" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "protein-classifier-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Description" = "Docker images for protein classifier API"
          + "Name"        = "protein-classifier-api"
        }
      + tags_all             = {
          + "Description" = "Docker images for protein classifier API"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-west-2:462498369025:cluster/protein-classifier-api-1-0-0-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "protein-classifier-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "protein-classifier-api-service"
        }
      + tags_all                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-service"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "protein-classifier-api"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0822fb8754073fb32",
            ]
          + subnets          = [
              + "subnet-034dbf0d24493ddf3",
              + "subnet-0a9d6de07abc7f763",
            ]
        }
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "protein-classifier-api"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "protein-classifier-api-task"
        }
      + tags_all                 = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-task"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_flow_log.main will be created
  + resource "aws_flow_log" "main" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "protein-classifier-vpc-flow-log"
        }
      + tags_all                 = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-vpc-flow-log"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-09f46860bd3f1f05c"
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "protein-classifier-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Description" = "ECS task execution role for pulling images and logging"
          + "Name"        = "protein-classifier-ecs-task-execution-role"
        }
      + tags_all              = {
          + "Description" = "ECS task execution role for pulling images and logging"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-ecs-task-execution-role"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "protein-classifier-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Description" = "ECS task role for application runtime permissions"
          + "Name"        = "protein-classifier-ecs-task-role"
        }
      + tags_all              = {
          + "Description" = "ECS task role for application runtime permissions"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-ecs-task-role"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:kmesiab/concept-model-protein-classifier:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::462498369025:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "protein-classifier-github-actions-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Description" = "IAM role for GitHub Actions OIDC authentication"
          + "Name"        = "protein-classifier-github-actions-role"
        }
      + tags_all              = {
          + "Description" = "IAM role for GitHub Actions OIDC authentication"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-github-actions-role"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.vpc_flow_logs will be created
  + resource "aws_iam_role" "vpc_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "protein-classifier-vpc-flow-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "protein-classifier-vpc-flow-logs-role"
        }
      + tags_all              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-vpc-flow-logs-role"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_policy" {
      + id          = (known after apply)
      + name        = "ecs-task-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github_actions_policy will be created
  + resource "aws_iam_role_policy" "github_actions_policy" {
      + id          = (known after apply)
      + name        = "github-actions-deployment-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.vpc_flow_logs will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id          = (known after apply)
      + name        = "protein-classifier-vpc-flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "protein-classifier-ecs-task-execution-role"
    }

  # aws_kms_alias.cloudwatch_logs_alias will be created
  + resource "aws_kms_alias" "cloudwatch_logs_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cloudwatch-logs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.cloudwatch_logs will be created
  + resource "aws_kms_key" "cloudwatch_logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for CloudWatch log group encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "cloudwatch-logs-key"
        }
      + tags_all                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudwatch-logs-key"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
    }

  # aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "protein-classifier-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-052e25ef7707ee664",
        ]
      + subnets                                                      = [
          + "subnet-067b8b58bdacbd8ef",
          + "subnet-097cbe6706c0bba59",
        ]
      + tags                                                         = {
          + "Name" = "protein-classifier-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-alb"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb-logs"
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-west-2:462498369025:certificate/bd8958a6-a142-42df-82bb-1cdb82456ff6"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Ext1-2021-06"
      + tags_all                                                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.ecs will be created
  + resource "aws_lb_target_group" "ecs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "protein-classifier-ecs-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "protein-classifier-ecs-tg"
        }
      + tags_all                           = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-ecs-tg"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09f46860bd3f1f05c"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 15
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.proteinclassifier.com"
      + type            = "A"
      + zone_id         = "Z0960642JHAEZB1G2JKV"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.alb_logs will be created
  + resource "aws_s3_bucket" "alb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "protein-classifier-alb-logs-462498369025"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "protein-classifier-alb-logs"
        }
      + tags_all                    = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-alb-logs"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.alb_logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "alb_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "abort-incomplete-multipart-uploads"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }
        }
      + rule {
          + id     = "archive-old-versions"
          + status = "Enabled"

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "GLACIER"
            }
        }
      + rule {
          + id     = "intelligent-tiering"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 1
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
    }

  # aws_s3_bucket_policy.alb_logs will be created
  + resource "aws_s3_bucket_policy" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.alb_logs will be created
  + resource "aws_s3_bucket_public_access_block" "alb_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.alb_logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.alb_logs will be created
  + resource "aws_s3_bucket_versioning" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name            = (known after apply)
  + alb_target_group_arn    = (known after apply)
  + ecr_repository_url      = (known after apply)
  + github_actions_role_arn = (known after apply)
```
</details>

### 🔍 Key Changes Detected

- 🐳 **ECS Service** changes detected
- ⚖️ **Load Balancer** changes detected
- 🔑 **IAM** changes detected

### ✅ Validation Status

- **Format Check:** ✅ Pass
- **Init:** ✅ Pass
- **Validate:** ✅ Pass
- **Plan:** ✅ Pass


---
<sub>💡 This plan preview helps you review infrastructure changes before applying them.</sub>
